H4W9/ESP32_Mastermine/ESP32_Mastermine.ino
/* ============================================================================
   ESP32 Mastermine — Pancake (ESP32-C5, ST7796 320x480, FT6336 capacitive touch)
   ============================================================================
   Minesweeper on the surface of a rotatable 3D cube, after Mastermine by Adam
   Soutar (https://mastermine.app). Swipe to turn the cube, pinch to zoom, and
   dress it in the user-created skins from the game's own skin store — either
   downloaded on the device over WiFi or sideloaded with sd_prep/fetch_skins.py.

   Standalone touch firmware sharing the H4W9 UI shell with ESP32_Scrabble and
   ESP32_FlipSocial: header with back button and status corner, footer nav bar,
   momentum list menus, chip settings rows, VLW smooth fonts throughout.

   Arduino IDE settings:
     Board            : ESP32C5 Dev Module
     Flash Size       : 8MB
     Partition Scheme : Custom  ->  partitions.csv in this folder
     Flash Frequency  : 80 MHz
     PSRAM            : Enabled     <-- required, the render sprite lives there

   Requires the patched TFT_eSPI-ESP32-C5 library with User_Setup_Select.h set
   to #include <User_Setup_marauder_pancake.h>.

   Two traps this sketch is written around, both paid for once already in
   ESP32_Scrabble:
     * No template functions in a .ino — Arduino's ctags prototype pass emits
       them without the template<> line. Templates live in headers.
     * Likewise no file-local struct/enum used in a .ino function signature.
       Every type here comes from a header.
   ============================================================================ */

#include "configs.h"

#include <Arduino.h>
#include <SPI.h>
#include <SD.h>
#include <SPIFFS.h>
#include <Wire.h>
#include <WiFi.h>
#include <ArduinoJson.h>

#include "ft6336.h"
#include "TouchKeyboard.h"
#include "theme.h"
#include "vlw.h"
#include "cube.h"
#include "puconfig.h"
#include "skin.h"
#include "skinstore.h"
#include "render3d.h"

// Picoware core (panel init, touch).
#include "src/Picoware/internal/boards.hpp"
#include "src/Picoware/internal/gui/draw.hpp"
#include "src/Picoware/internal/system/input.hpp"
#include "src/Picoware/internal/system/view.hpp"
#include "src/Picoware/internal/system/view_manager.hpp"
using namespace Picoware;

// Globals
#ifdef HAS_C5_SD
SPIClass sharedSPI(SPI);
#endif

static ViewManager *vm    = nullptr;   // owns Draw (panel) + InputManager (touch)
static TFT_eSPI    *tft   = nullptr;   // raw panel (from Draw) for the shell screens
static TouchInput  *touch = nullptr;   // touch source (from InputManager)
static Theme        theme;             // colour theme + accent + font + brightness

// Theme-driven colours (macros so every use follows the current theme).
#define COL_BG     (theme.bg())
#define COL_FG     (theme.fg())
#define COL_ACCENT (theme.hdr())
#define COL_DIM    (theme.dim())
#define COL_SEL    (theme.sel())
static const uint16_t COL_OK = 0x07E0;   // status green (theme-independent)

// The cube sits on a flat dark grey, not on the theme's background. rgb(30,30,30)
// is measured off the reference game's own screens — a near-black theme
// background swallows the cube's darker faces, and its cleared blocks are
// near-black themselves. Light themes keep their own background, where the
// problem does not arise.
static const uint16_t COL_GAME_BG_DARK = 0x18E3;   // rgb(30,30,30)

// Panel size comes from the board block in configs.h. The whole UI is portrait;
// nothing here rotates the panel.
static const int SCRW = TFT_WIDTH;
static const int SCRH = TFT_HEIGHT;

// Shell layout — matches H4W9 (header 28, nav 28, list rows 34).
static const int HDRH     = 28;
static const int NAVH     = 28;
#ifdef MARAUDER_V8
static const int ITEMH    = 26;
#else
static const int ITEMH    = 34;
#endif
static const int CONTENTY = HDRH;

// Game state. Declared before the first function so Arduino's generated
// prototypes land below the types they mention.
static Cube     g_cube;
static Skin     g_skin;
static CubeView g_view;
static bool     g_gameActive = false;

// Skin ids. Store skins are numbered from 1 by mastermine.app, so the built-in
// sets take 0 and a high sentinel that no store id will ever collide with.
static const uint16_t SKIN_ID_CLEAN   = 0;
static const uint16_t SKIN_ID_GOLD    = 0xFFFF;
static const uint16_t SKIN_ID_CLASSIC = 0xFFFE;

// Tap vs hold, matching the reference game's Controls screen exactly:
//   REVEAL   Hold
//   FLAG     Tap
//   CHORDING Hold  (on an already-revealed number)
//   TAP VS HOLD CUTOFF  0.25 s
// These are fixed — the reference offers them as settings, but on a panel this
// size the footer slot is better spent on Pause.
static const uint32_t HOLD_MS = 250;

// Persisted settings (/mine_cfg.json)
static uint8_t  g_diff    = DIFF_ADVANCED;
static uint8_t  g_n       = 8;
static uint8_t  g_pct     = 17;             // custom games; ~the game's own density
static uint16_t g_skinId  = SKIN_ID_CLEAN;  // the reference game's own default look

#ifndef HAS_CAP_TOUCH
// Resistive touch calibration (V8). Capacitive panels report real coordinates
// and need none of this.
static const char *TOUCH_CAL_FILE = "/mine_touch.dat";

static bool touchCalLoad(uint16_t *cal) {
  File f = SPIFFS.open(TOUCH_CAL_FILE, "r");
  if (!f) return false;
  bool ok = (f.read((uint8_t *)cal, sizeof(uint16_t) * 5) == sizeof(uint16_t) * 5);
  f.close();
  return ok;
}
static void touchCalSave(const uint16_t *cal) {
  File f = SPIFFS.open(TOUCH_CAL_FILE, "w");
  if (!f) return;
  f.write((const uint8_t *)cal, sizeof(uint16_t) * 5);
  f.close();
}
static void touchCalRun() {
  uint16_t cal[5];
  tft->fillScreen(TFT_BLACK);
  tft->setTextColor(TFT_WHITE, TFT_BLACK);
  tft->setTextDatum(MC_DATUM);
  tft->drawString("Touch Calibration", SCRW / 2, SCRH / 2 - 24, 4);
  tft->drawString("Tap each corner arrow", SCRW / 2, SCRH / 2 + 6, 2);
  tft->setTextDatum(TL_DATUM);
  delay(1500);
  tft->fillScreen(TFT_BLACK);
  tft->calibrateTouch(cal, TFT_MAGENTA, TFT_BLACK, 15);
  tft->setTouch(cal);
  touchCalSave(cal);
}
static void touchCalInit() {
  uint16_t cal[5];
  if (touchCalLoad(cal)) tft->setTouch(cal);
  else                   touchCalRun();
}
#endif // !HAS_CAP_TOUCH

// Touch helpers
static bool waitTap(uint16_t &x, uint16_t &y, uint32_t timeoutMs = 0) {
  uint32_t start = millis();
  bool wasDown = touch->isPressed();
  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    if (down && !wasDown) { x = touch->x(); y = touch->y(); return true; }
    wasDown = down;
    if (timeoutMs && (millis() - start) > timeoutMs) return false;
    delay(8);
    yield();
  }
}

