H4W9/ESP32_Mastermine/ESP32_Mastermine.ino
  for (;;) {
    tft->fillScreen(COL_BG);
    drawHeader("Skin Store", true);
    tft->setTextColor(COL_DIM, COL_BG);
    tft->setTextDatum(MC_DATUM);
    drawStr(String("Loading page ") + (page + 1) + "...", SCRW / 2, SCRH / 2, 2);
    tft->setTextDatum(TL_DATUM);
    ledWifi();
    int n = store.fetchPage(page, entries, STORE_PAGE_MAX);
    ledOff();

    if (n < 0) {
      msgScreen("Skin Store", "Could not reach the store", store.lastError(), TFT_RED);
      return;
    }
    for (int i = 0; i < n; i++)
      rows[i] = String(entries[i].name) + "   " + entries[i].downloads + " dl" +
                (entries[i].nTextures < TK_COUNT
                   ? String("  (") + entries[i].nTextures + "/" + TK_COUNT + ")" : String(""));

    int sel = scrollList(String("Store p") + (page + 1), rows, n, true,
                         page > 0 ? "Prev" : "", "", store.eof() ? "" : "Next");
    if (sel == SL_BACK) { store.release(); return; }
    if (sel == SL_F0) { if (page > 0) page--; continue; }
    if (sel == SL_F2) { if (!store.eof()) page++; continue; }
    if (sel < 0 || sel >= n) continue;

    tft->fillScreen(COL_BG);
    drawHeader("Downloading", true);
    tft->setTextColor(COL_FG, COL_BG);
    tft->setTextDatum(MC_DATUM);
    drawStr(entries[sel].name, SCRW / 2, SCRH / 2 - 40, 4);
    tft->setTextDatum(TL_DATUM);
    ledWifi();
    int got = store.download(sel, skinDlProgress, nullptr);
    ledOff();

    if (got <= 0) {
      msgScreen("Skin Store", "Download failed", store.lastError(), TFT_RED);
      continue;
    }
    g_skinId = entries[sel].id;
    cfgSave();
    skinLoad(g_skinId);
    msgScreen("Skin Store", String("Installed ") + entries[sel].name,
              got < TK_COUNT
                ? String("Got ") + got + " of " + TK_COUNT +
                  " textures. The rest use the built-in art - plenty of skins on "
                  "the store are published incomplete."
                : String("All ") + TK_COUNT + " textures installed.", COL_OK);
    store.release();
    return;
  }
}

// Skins already on the card, plus a way to the store.
static void skinsScreen() {
  static SkinEntry sd[SKIN_MAX_SD];
  static String rows[SKIN_MAX_SD + SKIN_VARIANTS];
  // The built-in sets head the list, then whatever is on the card.
  static const uint16_t BUILTIN_IDS[SKIN_VARIANTS] = {
    SKIN_ID_CLEAN, SKIN_ID_GOLD, SKIN_ID_CLASSIC };
  static const uint8_t BUILTIN_VAR[SKIN_VARIANTS] = {
    SKIN_CLEAN, SKIN_GOLD, SKIN_CLASSIC };
  const int nb = SKIN_VARIANTS;

  for (;;) {
    int n = skinScanSd(sd, SKIN_MAX_SD);
    for (int i = 0; i < nb; i++)
      rows[i] = String(g_skinId == BUILTIN_IDS[i] ? "* " : "")
              + SKIN_VARIANT_NAMES[BUILTIN_VAR[i]] + "  (built-in)";
    for (int i = 0; i < n; i++)
      rows[nb + i] = String(g_skinId == sd[i].id ? "* " : "") + sd[i].name;

    int sel = scrollList("Skins", rows, n + nb, true, "Back", "Get More", "");
    if (sel == SL_BACK || sel == SL_F0) return;
    if (sel == SL_F1) { skinStoreScreen(); continue; }
    if (sel < 0 || sel >= n + nb) continue;

    g_skinId = (sel < nb) ? BUILTIN_IDS[sel] : sd[sel - nb].id;
    cfgSave();
    skinLoad(g_skinId);
    return;
  }
}

//  Game screen
//
//  The cube is composited into one PSRAM sprite by CubeView and pushed whole,
//  so nothing on this screen ever draws to the panel mid-frame. The header,
//  banner and footer are painted once and only repainted when their contents
//  actually change — that is the no-flashing rule.
//
//    header  28   back chevron, mines left, clock
//    banner  20   powerup results, win/lose, hints
//    cube         everything between
//    nav     28   [Flag/Dig] [Power] [Recentre]
static const int G_BANH = 20;
static const int G_BANY = HDRH;
static const int G_CUBY = HDRH + G_BANH;
static const int G_CUBH = SCRH - G_CUBY - NAVH;

static String   g_banner;
static int      g_armed = -1;        // powerup armed for the next tap, or -1

static uint16_t gameBg() { return theme.dark() ? COL_GAME_BG_DARK : COL_BG; }

static String fmtClock(uint32_t ms) {
  uint32_t s = ms / 1000;
  char b[12];
  snprintf(b, sizeof(b), "%u:%02u", (unsigned)(s / 60), (unsigned)(s % 60));
  return String(b);
}

// Repaints only when the text actually changes. The game loop asks twice a
// second, but the clock only ticks once, and repainting a strip that has not
// changed is exactly the kind of avoidable flicker this firmware is meant not
// to have. Pass force after something else has painted over the header.
static String g_hdrLast;
static void gDrawHeader(bool force = false) {
  String s = String(g_cube.minesLeft()) + "  mines   " + fmtClock(g_cube.elapsedMs());
  g_hdrShowBack = true;
  // Even when the title has not changed, the memory figures and status corner
  // are worth refreshing — they are the reason for the periodic call.
  if (!force && s == g_hdrLast) { drawHeaderMem(); drawHeaderStatus(); return; }
  g_hdrLast = s;
  g_hdrShowBack = true;
  tft->fillRect(0, 0, SCRW, HDRH, COL_ACCENT);
  tft->fillRoundRect(2, 3, 40, 22, 4, COL_ACCENT);
  tft->drawRoundRect(2, 3, 40, 22, 4, theme.neon(3, COL_DIM));
  drawChevron(2, 3, 40, 22, false, COL_FG);
  drawHeaderMem();
  tft->setTextColor(COL_FG, COL_ACCENT);
  tft->setTextDatum(MC_DATUM);
  drawStr(s, (g_hdrMemRight + SCRW - HDR_STATUS_W) / 2, HDRH / 2, 2);
  tft->setTextDatum(TL_DATUM);
  drawHeaderStatus();
}

// Zoom chips.
//
// Only on boards without multitouch. The V8's XPT2046 is a resistive panel and
// cannot physically report a second contact, so there is no pinch gesture to be
// had there — it gets the same [-]/[+] chip pair the brightness setting uses.
// The Pancake's FT6336 tracks two fingers, so it pinches instead and keeps the
// banner width for text.
#ifndef HAS_MULTITOUCH
static const int GZ_W = 26, GZ_H = 18;
static int gzMinusX() { return SCRW - 2 * GZ_W - 12; }
static int gzPlusX()  { return SCRW - GZ_W - 6; }
static int gzY()      { return G_BANY + (G_BANH - GZ_H) / 2; }
static void gDrawZoomChips() {
  int y = gzY();
  for (int i = 0; i < 2; i++) {
    int x = i ? gzPlusX() : gzMinusX();
    tft->fillRoundRect(x, y, GZ_W, GZ_H, 4, COL_ACCENT);
    tft->drawRoundRect(x, y, GZ_W, GZ_H, 4, theme.neon(i + 5, COL_DIM));
    drawPlusMinus(x, y, GZ_W, GZ_H, i == 1, COL_FG);
  }
}
static int gZoomHit(int x, int y) {
  if (y < gzY() || y >= gzY() + GZ_H) return -1;
  if (x >= gzMinusX() && x < gzMinusX() + GZ_W) return 0;
  if (x >= gzPlusX()  && x < gzPlusX()  + GZ_W) return 1;
  return -1;
}
#endif

static void gDrawBanner() {
  tft->fillRect(0, G_BANY, SCRW, G_BANH, gameBg());
  int textW = SCRW;
#ifndef HAS_MULTITOUCH
  gDrawZoomChips();
  textW = gzMinusX() - 4;                 // keep the text clear of the chips
#endif
  if (!g_banner.length()) return;
  uint16_t c = (g_cube.state() == GS_LOST) ? TFT_RED
             : (g_cube.state() == GS_WON)  ? COL_OK : COL_DIM;
  tft->setTextColor(c, gameBg());
  tft->setTextDatum(MC_DATUM);
  drawStr(g_banner, textW / 2, G_BANY + G_BANH / 2, 2);
  tft->setTextDatum(TL_DATUM);
}

// Also change-detecting: the footer has few states, but it is consulted on
// every touch release, and repainting it each time is a visible flicker at the
// bottom of the screen.
static String g_navLast;
static void gDrawNav(bool force = false) {
  const char *m = (g_armed >= 0) ? "Cancel" : "Power";
  String sig = String("Pause|") + m;
  if (!force && sig == g_navLast) return;
  g_navLast = sig;
  drawNav("Pause", m, "Recentre");
}

