H4W9/ESP32_Mastermine/ESP32_Mastermine.ino
// Pause: a small modal over the cube. Returns true to resume, false to leave
// for the main menu. The clock is not stopped — the reference does not either,
// and stopping it would make Pause a way to game the timer.
static bool pauseDialog() {
  const int bw = SCRW - 72, bh = 46, bx = 36;
  const int y0 = SCRH / 2 - 60, y1 = SCRH / 2 + 4;

  tft->fillRoundRect(20, y0 - 54, SCRW - 40, 190, 10, COL_BG);
  tft->drawRoundRect(20, y0 - 54, SCRW - 40, 190, 10, theme.neon(2, COL_DIM));
  tft->setTextColor(COL_FG, COL_BG);
  tft->setTextDatum(MC_DATUM);
  drawStr("Paused", SCRW / 2, y0 - 26, 4);
  tft->setTextDatum(TL_DATUM);

  auto button = [&](int y, const char *label, int seed) {
    tft->fillRoundRect(bx, y, bw, bh, 8, COL_ACCENT);
    tft->drawRoundRect(bx, y, bw, bh, 8, theme.neon(seed, COL_DIM));
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
    drawStr(label, SCRW / 2, y + bh / 2, 2);
    tft->setTextDatum(TL_DATUM);
  };
  button(y0, "Resume", 1);
  button(y1, "Back to Menu", 5);

  for (;;) {
    uint16_t x, y;
    if (!waitTap(x, y)) continue;
    if ((int)y >= y0 && (int)y < y0 + bh && (int)x >= bx && (int)x < bx + bw) return true;
    if ((int)y >= y1 && (int)y < y1 + bh && (int)x >= bx && (int)x < bx + bw) return false;
    // A tap anywhere else dismisses it, which is what a modal like this should
    // do rather than trapping the player.
    if ((int)y < y0 - 54 || (int)y > y0 - 54 + 190) return true;
  }
}

// Read touch for the game screen. On the Pancake this goes straight to the
// FT6336 so it can see a second finger for pinch-zoom; the V8's resistive panel
// can only ever report one contact, so it takes the shell's path and gets
// zoom buttons instead.
static uint8_t gTouch(int &x1, int &y1, int &x2, int &y2) {
#ifdef HAS_MULTITOUCH
  uint16_t ax, ay, bx, by;
  uint8_t n = ft6336_read_raw2(&ax, &ay, &bx, &by);
  if (n >= 1) { x1 = ax; y1 = ay; }
  if (n >= 2) { x2 = bx; y2 = by; }
  return n;
#else
  touch->run();
  if (!touch->isPressed()) return 0;
  x1 = touch->x();
  y1 = touch->y();
  return 1;
#endif
}

static void gApplyResult(bool changed) {
  if (!changed) return;
  // Lifesaver is passive — reveal() spends it on its own, so the only place it
  // can be reported is here, after the fact.
  if (g_cube.takeLifesaverUsed()) g_banner = "Lifesaver! Mine flagged.";
  if (g_cube.state() == GS_WON)
    g_banner = String("Solved in ") + fmtClock(g_cube.elapsedMs()) + "!";
  if (g_cube.state() == GS_LOST) {
    g_banner = "Boom.";
    // Ring the mine that actually went off, so it is obvious which tap lost it.
    for (uint16_t c = 0; c < g_cube.cells(); c++)
      if (g_cube.isBoom(c)) { g_view.setHighlight((int)c, TFT_RED); break; }
  }
}

// A short tap: flag, dig, chord or fire an armed powerup, depending on mode and
// on what the cell already is.
static void gTapCell(uint16_t cell, bool longPress, uint8_t face) {
  if (g_armed >= 0) {
    uint8_t out = 0;
    if (g_cube.usePowerup((Powerup)g_armed, cell, out, face)) {
      switch (g_armed) {
        case PU_BURST:     g_banner = String("Burst revealed ") + out + " blocks"; break;
        case PU_LIGHTNING: g_banner = String("Lightning revealed ") + out + " blocks"; break;
        case PU_SONAR:     g_banner = (out == 0) ? String("Sonar: all clear")
                                                 : String("Sonar: ") + out + " mines"; break;
        default:           g_banner = "Used"; break;
      }
    } else {
      g_banner = "Powerup unavailable";
    }
    g_armed = -1;
    return;
  }

  // The reference game's Controls screen maps REVEAL and CHORDING to the SAME
  // gesture (both "Hold") and FLAG to the other one — chording is not a
  // separate gesture, it is what a reveal means on an already-revealed number.
  if (!longPress) { gApplyResult(g_cube.cycleFlag(cell)); return; }

  if (g_cube.stateOf(cell) == CS_REVEALED) {
    if (g_cube.adj(cell) > 0) gApplyResult(g_cube.chord(cell));
    return;
  }
  gApplyResult(g_cube.reveal(cell));
}

// What each powerup does, on its own screen rather than crammed into the menu
// rows — those only have to say what you are holding.
static void powerupInfoScreen() {
  tft->fillScreen(COL_BG);
  drawHeader("Power-up Info", true);
  int y = CONTENTY + 10;
  const int maxW = SCRW - 28;
  for (int i = 0; i < PU_COUNT && y < SCRH - 40; i++) {
    tft->setTextColor(COL_FG, COL_BG);
    tft->setTextDatum(TL_DATUM);
    drawStr(PU_NAMES[i], 12, y, 2);
    y += 18;
    // Word-wrapped, so a long blurb cannot run off the panel.
    tft->setTextColor(COL_DIM, COL_BG);
    String line = "", rest = PU_BLURBS[i];
    while (rest.length() && y < SCRH - 24) {
      int sp = rest.indexOf(' ');
      String word = (sp < 0) ? rest : rest.substring(0, sp);
      String cand = line.length() ? line + " " + word : word;
      if (strWidth(cand, 2) <= maxW) line = cand;
      else { drawStr(line, 18, y, 2); y += 16; line = word; }
      rest = (sp < 0) ? "" : rest.substring(sp + 1);
    }
    if (line.length() && y < SCRH - 24) { drawStr(line, 18, y, 2); y += 16; }
    y += 6;
  }
  statusLine("Tap to go back.", COL_DIM);
  uint16_t x, ty; waitTap(x, ty);
}

static void powerupDialog() {
  static String rows[PU_COUNT + 1];          // + the info row
  for (int i = 0; i < PU_COUNT; i++) {
    rows[i] = String(PU_NAMES[i]) + "   x" + g_cube.held((Powerup)i);
    if (i == PU_LIFESAVER && g_cube.lifeArmed()) rows[i] += "   ARMED";
  }
  rows[PU_COUNT] = "Power-up Info";

  int sel = scrollList("Power-ups", rows, PU_COUNT + 1, true, "Back", "", "");
  if (sel == PU_COUNT) { powerupInfoScreen(); return; }
  if (sel < 0 || sel >= PU_COUNT) return;
  if (g_cube.held((Powerup)sel) == 0) { g_banner = "None left"; return; }

  // Lifesaver takes no target: activating it arms it there and then. It is
  // never spent without the player asking for it.
  if (!g_cube.needsTarget((Powerup)sel)) {
    uint8_t out = 0;
    if (g_cube.usePowerup(PU_LIFESAVER, 0, out)) g_banner = "Lifesaver armed";
    else g_banner = out ? "Lifesaver already armed" : "Not yet - make a move first";
    g_armed = -1;
    return;
  }

