H4W9/ESP32_Mastermine/ESP32_Mastermine.ino
  g_armed = sel;
  g_banner = (sel == PU_BURST)     ? "Tap a block to burst"
           : (sel == PU_LIGHTNING) ? "Tap a block to strike"
                                   : "Tap a block to scan";
}

static void gameScreen() {
  if (!g_cube.ready()) return;

  if (!g_view.ok() && !g_view.begin(tft, 0, G_CUBY, SCRW, G_CUBH)) {
    msgScreen("Mastermine", "Out of PSRAM",
              String("The cube needs an off-screen buffer of about ")
              + (uint32_t)(SCRW * G_CUBH * 2 / 1024) +
              " KB. Check Tools -> PSRAM -> Enabled.", TFT_RED);
    return;
  }
  g_view.attach(&g_cube, &g_skin);
  g_view.refit();

  tft->fillScreen(gameBg());
  gDrawHeader(true);
  gDrawBanner();
  gDrawNav(true);

  bool  dirty = true;
  int   downN = 0;
  int   px = 0, py = 0;
  uint32_t downT = 0;
  bool  moved = false, fired = false;
  float velYaw = 0, velPitch = 0;
  float pinch0 = 0, zoom0 = 1.0f;
  uint32_t lastT = millis(), lastClock = 0;
  String lastBanner = g_banner;

  // Drag smoothing. The FT6336 updates around 60 Hz while the cube now renders
  // faster than that, so a raw coordinate read repeats for a few frames and
  // then jumps when a fresh sample lands; capacitive coordinates also jitter a
  // few pixels even with the finger still. Driving the rotation from a smoothed
  // finger position (fx,fy easing toward the raw read) turns both the
  // stair-steps and the jitter into continuous motion. Higher = snappier and
  // less smooth; lower = smoother and laggier.
  const float DRAG_SMOOTH = 0.45f;
  float fx = 0, fy = 0, pfx = 0, pfy = 0;
  // Bridge brief capacitive dropouts: the sensor occasionally reports "no
  // touch" for a single frame mid-drag. Treated as a real lift it would zero
  // the fling velocity and reset the reference point, chopping the gesture into
  // a jump. Pretend the last touch persists for up to this many dropped frames.
  const int TOUCH_BRIDGE = 2;
  int lostFrames = 0;

  // Frame-rate profiler. Set MM_PROFILE 0 to remove it. While the cube is in
  // motion it prints, once a second over Serial, how a frame divides between
  // the sprite clear, the block fill and the SPI push — so tuning is aimed at
  // whichever actually dominates instead of guessed at.
#define MM_PROFILE 1
#if MM_PROFILE
  uint32_t profT0 = millis();
  uint32_t profN = 0, profFrameUs = 0, profWorstUs = 0;
  uint32_t profClear = 0, profBlocks = 0, profPush = 0;
  uint32_t profLastFrame = micros();
#endif

  for (;;) {
    int x1 = 0, y1 = 0, x2 = 0, y2 = 0;
    uint8_t n = gTouch(x1, y1, x2, y2);
    uint32_t now = millis();
    float dt = (now - lastT) / 1000.0f;
    if (dt <= 0) dt = 0.001f;
    lastT = now;

    // Bridge a brief single-finger dropout: keep the last touch alive, held at
    // its last position, so one dropped frame does not end the drag. Only for a
    // one-finger drag — a pinch would need the second point, which we do not
    // keep across frames, so a two-finger dropout is left to release normally.
    if (n == 0 && downN == 1 && lostFrames < TOUCH_BRIDGE) {
      lostFrames++;
      n = 1; x1 = px; y1 = py;
    } else if (n >= 1) {
      lostFrames = 0;
    }

    // Press edge
    if (n && !downN) {
      px = x1; py = y1; downT = now; moved = false; fired = false;
      velYaw = velPitch = 0;
      lostFrames = 0;
      if (n >= 2) { pinch0 = hypotf((float)(x2 - x1), (float)(y2 - y1)); zoom0 = g_view.zoom(); }
    }

    // Two fingers: pinch to zoom, and nothing else.
    //
    // A twist-to-roll gesture was tried here and removed: the FT6336 does not
    // keep the two contacts in a stable order, so the pair swaps identity
    // between frames and the angle between them jumps by half a turn, which
    // threw the cube around at random. Rotation stays a one-finger drag.
    if (n >= 2) {
      float d = hypotf((float)(x2 - x1), (float)(y2 - y1));
      if (pinch0 < 8.0f) { pinch0 = d; zoom0 = g_view.zoom(); }
      if (d > 8.0f) {
        g_view.setZoom(zoom0 * (d / pinch0));
        g_view.setFast(true);
        moved = true;
        dirty = true;
      }
    } else if (n == 1 && downN) {
      int dx = x1 - px, dy = y1 - py;
      if (!moved && (abs(dx) > 5 || abs(dy) > 5)) {
        // Start the smoother here, at the current point, so the accumulated
        // pre-move distance is not applied as one initial rotation kick.
        moved = true;
        fx = pfx = (float)x1; fy = pfy = (float)y1;
      }
      if (moved) {
        // Drag to orbit, driven by the SMOOTHED finger position (see the note
        // on DRAG_SMOOTH). Dividing by the viewport makes a full swipe about a
        // half turn regardless of panel size. The x term is positive so that
        // dragging right spins the cube's near face to the right, i.e. the
        // surface follows the finger.
        fx += DRAG_SMOOTH * ((float)x1 - fx);
        fy += DRAG_SMOOTH * ((float)y1 - fy);
        float dyaw   = (fx - pfx) * 3.2f / (float)SCRW;
        float dpitch = (fy - pfy) * 3.2f / (float)G_CUBH;
        pfx = fx; pfy = fy;
        g_view.orbit(dyaw, dpitch);
        // Track velocity as an EMA so the fling on release reflects the smoothed
        // motion, not whatever the last single (possibly held) frame did.
        velYaw   += 0.4f * (dyaw / dt - velYaw);
        velPitch += 0.4f * (dpitch / dt - velPitch);
        g_view.setFast(true);
        px = x1; py = y1;
        dirty = true;
      } else if (!fired && (now - downT) > HOLD_MS) {
        // Long press fires at the threshold rather than on release: waiting for
        // the lift makes "hold to dig" feel unresponsive.
        if (backTapped(px, py) || py >= SCRH - NAVH) {
          // header/footer — leave to the release handler
        } else {
          uint8_t face = CUBE_FACES;
          int cell = g_view.pick(px, py, &face);
          if (cell >= 0) { gTapCell((uint16_t)cell, true, face); fired = true; dirty = true; }
        }
      }
    }

    // Release edge
    if (!n && downN) {
      g_view.setFast(false);
      dirty = true;
      if (!moved && !fired) {
        if (backTapped(px, py)) {
          g_view.setHighlight(-1, 0);
          g_cube.save(SAVE_DIR "/auto.sav");
          return;
        }
#ifndef HAS_MULTITOUCH
        int gz = gZoomHit(px, py);
        if (gz >= 0) {
          g_view.setZoom(g_view.zoom() * (gz ? 1.25f : 0.8f));
          downN = n;
          dirty = true;
          delay(4);
          continue;
        }
#endif
        int nh = navHit(px, py);
        if (nh == 0) {
          bool resume = pauseDialog();
          g_cube.save(SAVE_DIR "/auto.sav");
          if (!resume) { g_view.setHighlight(-1, 0); return; }
          tft->fillScreen(gameBg());
          gDrawHeader(true); gDrawBanner(); gDrawNav(true);
          dirty = true;
        }
        else if (nh == 1) { if (g_armed >= 0) { g_armed = -1; g_banner = ""; }
                            else powerupDialog();
                            tft->fillScreen(gameBg());
                            gDrawHeader(true); gDrawBanner(); gDrawNav(true); }
        else if (nh == 2) { g_view.resetCamera(); g_view.setZoom(1.0f); }
        else if (py >= G_CUBY && py < G_CUBY + G_CUBH) {
          uint8_t face = CUBE_FACES;
          int cell = g_view.pick(px, py, &face);
          if (cell >= 0) gTapCell((uint16_t)cell, false, face);
        }
        gDrawNav();
      } else if (fabsf(velYaw) > 0.4f || fabsf(velPitch) > 0.4f) {
        // Keep the spin going, same feel as the momentum lists.
      } else {
        velYaw = velPitch = 0;
      }
    }

