H4W9/ESP32_Mastermine/ESP32_Mastermine.ino
    // Momentum spin, decaying like the list fling.
    if (!n && (fabsf(velYaw) > 0.05f || fabsf(velPitch) > 0.05f)) {
      g_view.orbit(velYaw * dt, velPitch * dt);
      float decay = expf(-2.6f * dt);
      velYaw *= decay;
      velPitch *= decay;
      dirty = true;
    }

    downN = n;

    // A sonar ping shows the nearby mines and fades them back to hidden over a
    // second, so the view has to keep repainting for as long as it lasts even
    // though nothing is being touched.
    if (g_cube.sonarActive()) dirty = true;

    // While the cube is moving, nothing else may draw to the panel: a drag or a
    // momentum spin is repainting the whole cube region every frame, and the
    // header draws straight to the panel over the same SPI bus. Repainting it
    // mid-motion cost an SPI stall twice a second — a periodic hitch in an
    // otherwise smooth rotation. Defer it until the cube comes to rest; the
    // clock/mem readout is never more than a breath stale.
    const bool moving = dirty && (moved || fabsf(velYaw) > 0.05f ||
                                  fabsf(velPitch) > 0.05f);
    if (g_banner != lastBanner) { lastBanner = g_banner; gDrawBanner(); }
    if (!moving && now - lastClock > 500) { lastClock = now; gDrawHeader(); }

    if (dirty) {
      g_view.render(gameBg());
      dirty = false;
#if MM_PROFILE
      if (moving) {
        const uint32_t nowUs = micros();
        const uint32_t frame = nowUs - profLastFrame;
        profLastFrame = nowUs;
        profN++;
        profFrameUs += frame;
        if (frame > profWorstUs) profWorstUs = frame;
        profClear  += g_view.usClear();
        profBlocks += g_view.usBlocks();
        profPush   += g_view.usPush();
      }
#endif
    }
#if MM_PROFILE
    else {
      profLastFrame = micros();          // don't count idle gaps as a frame
    }
    if (profN && millis() - profT0 >= 1000) {
      Serial.printf("cube: %lu fps  frame avg %lu us (worst %lu)  "
                    "clear %lu  blocks %lu  push %lu\n",
                    (unsigned long)profN,
                    (unsigned long)(profFrameUs / profN),
                    (unsigned long)profWorstUs,
                    (unsigned long)(profClear / profN),
                    (unsigned long)(profBlocks / profN),
                    (unsigned long)(profPush / profN));
      profT0 = millis();
      profN = profFrameUs = profWorstUs = 0;
      profClear = profBlocks = profPush = 0;
    }
#endif
    delay(2);
  }
}

//  New game / settings / about
// The size and mine count a new game would use. Named difficulties carry the
// reference game's own mine counts; a custom cube uses a density instead.
static uint8_t curN() { return (g_diff == DIFF_CUSTOM) ? g_n : DIFF_N[g_diff]; }
static uint16_t curMines() {
  if (g_diff != DIFF_CUSTOM) return DIFF_MINES[g_diff];
  return (uint16_t)(((uint32_t)cubeCellCount(g_n) * g_pct + 50) / 100);
}

static bool startGame() {
  const uint8_t  n     = curN();
  const uint16_t mines = curMines();

  tft->fillScreen(COL_BG);
  drawHeader("New Game", true);
  tft->setTextColor(COL_DIM, COL_BG);
  tft->setTextDatum(MC_DATUM);
  drawStr(String("Building ") + n + "x" + n + " cube...", SCRW / 2, SCRH / 2 - 12, 2);
  drawStr(String(mines) + " mines in " + cubeCellCount(n) + " blocks",
          SCRW / 2, SCRH / 2 + 12, 2);
  tft->setTextDatum(TL_DATUM);

  ledBusy();
  bool ok = g_cube.begin(n, mines);
  ledOff();
  if (!ok) {
    msgScreen("New Game", "Could not build the cube",
              "Out of memory at that size. Try a smaller cube in Settings.", TFT_RED);
    return false;
  }
  g_gameActive = true;
  g_banner = "";
  g_armed = -1;
  return true;
}

static void newGameFlow() {
  if (!g_skin.loaded()) skinLoad(g_skinId);
  if (!startGame()) return;
  gameScreen();
}

static void aboutScreen() {
  tft->fillScreen(COL_BG);
  drawHeader("About", true);

#ifdef MARAUDER_V8
  const int dName = 26, dSub = 17, dAuth = 18, dRule = 6, dRow = 17, dGap = 2, dRule2 = 6, dCred = 16;
  const int valX = 92;
#else
  const int dName = 32, dSub = 22, dAuth = 24, dRule = 10, dRow = 21, dGap = 4, dRule2 = 8, dCred = 20;
  const int valX = 120;
#endif

  int cx = SCRW / 2, y = CONTENTY + 12;

  tft->setTextColor(COL_FG, COL_BG);
  tft->setTextDatum(MC_DATUM);
  drawStr(FW_NAME, cx, y, 4); y += dName;
  drawStr(String("Version ") + FW_VERSION, cx, y, 2); y += dSub;
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr("UI by " FW_AUTHOR, cx, y, 2); y += dAuth;
  tft->drawFastHLine(16, y, SCRW - 32, theme.neon(1, theme.edge())); y += dRule;

  tft->setTextDatum(TL_DATUM);
  auto row = [&](const char *label, const String &value) {
    tft->setTextColor(COL_DIM, COL_BG); drawStr(label, 16, y, 2);
    tft->setTextColor(COL_FG, COL_BG);  drawStr(value, valX, y, 2);
    y += dRow;
  };
  row("Board",   BOARD_NAME);
  row("MCU",     BOARD_MCU);
  row("Display", BOARD_DISPLAY);
  row("Touch",   BOARD_TOUCH);
  {
    size_t ps = ESP.getPsramSize();
    if (ps >= 1024 * 1024)  row("PSRAM", String((unsigned)((ps + 512 * 1024) / (1024 * 1024))) + " MB");
    else if (ps > 0)        row("PSRAM", String((unsigned)(ps / 1024)) + " KB");
    else                    row("PSRAM", "None");
  }
  row("Built",   __DATE__);
  row("Commit",  FW_COMMIT);

  y += dGap;
  tft->drawFastHLine(16, y, SCRW - 32, theme.neon(2, theme.edge())); y += dRule2;

  // Credits, word-wrapped. They were fixed single lines and ran off the right
  // edge — "Skins are player-made, from mastermine.app" is wider than the V8
  // panel and wider than the Pancake's once the margins are taken off.
  tft->setTextColor(COL_DIM, COL_BG);
  tft->setTextDatum(TL_DATUM);
  const int credMaxW = SCRW - 32;
  static const char *const CREDITS[] = {
    "After Mastermine by Adam Soutar",
    "Skins are player-made, from mastermine.app",
  };
  for (int c = 0; c < 2 && y < SCRH - 30; c++) {
    String line = "", rest = CREDITS[c];
    while (rest.length() && y < SCRH - 30) {
      int sp = rest.indexOf(' ');
      String word = (sp < 0) ? rest : rest.substring(0, sp);
      String cand = line.length() ? line + " " + word : word;
      if (strWidth(cand, 2) <= credMaxW) line = cand;
      else { drawStr(line, 16, y, 2); y += dCred; line = word; }
      rest = (sp < 0) ? "" : rest.substring(sp + 1);
    }
    if (line.length() && y < SCRH - 30) { drawStr(line, 16, y, 2); y += dCred; }
  }

  statusLine("Tap to go back.", COL_DIM);
  uint16_t x, ty; waitTap(x, ty);
}

#ifdef HAS_CAP_TOUCH
static const int SET_N = 12;
#else
static const int SET_N = 13;
#endif
static const int SET_CHIP_LAST = 8;    // rows 0..8 carry chips (3 is an info row)

static String setChipVal(int row) {
  switch (row) {
    case 0: return theme.themeName();
    case 1: return theme.accentName();
    case 2: return theme.fontColName();
    case 4: return DIFF_NAMES[g_diff];
    case 5: return String(curN()) + "x" + curN();
    // Shown against the block total, because the number of blocks in a shell
    // is not something you can eyeball from N (an 8-cube is 296, not 384).
    case 6: return String(curMines()) + "/" + cubeCellCount(curN());
    case 7: return String(theme.bright + 1) + "/20";
    case 8: return String(theme.led_bright) + "/20";
  }
  return "";
}

static void drawSettingRowSpr(TFT_eSprite &g, int row, int y) {
  switch (row) {
    case 0: sprChipRow(g, y, "Theme",      setChipVal(0), false, 0, row); break;
    case 1: sprChipRow(g, y, "Accent",     setChipVal(1), false, 0, row); break;
    case 2: sprChipRow(g, y, "Font Color", setChipVal(2), false, theme.fontColPreview(), row); break;
    case 3: sprInfoRow(g, y, "Skin",       g_skin.loaded() ? String(g_skin.name()) : String("Built-in"), row); break;
    case 4: sprChipRow(g, y, "Difficulty", setChipVal(4), false, 0, row); break;
    case 5: sprChipRow(g, y, "Cube Size",  setChipVal(5), true,  0, row); break;
    case 6: sprChipRow(g, y, "Mines",      setChipVal(6), true,  0, row); break;
    case 7: sprChipRow(g, y, "Brightness", setChipVal(7), true,  0, row); break;
    case 8: sprChipRow(g, y, "LED",        setChipVal(8), true,  0, row); break;
    case 9:  sprInfoRow(g, y, "WiFi Setup", WiFi.status() == WL_CONNECTED ? WiFi.SSID() : String(""), row); break;
    case 10: sprInfoRow(g, y, "WiFi Debug", "", row); break;
    case 11: sprInfoRow(g, y, "About",      "", row); break;
#ifndef HAS_CAP_TOUCH
    case 12: sprInfoRow(g, y, "Calibrate Touch", "", row); break;
#endif
  }
}

// Editing Cube Size or Mines only makes sense for a custom cube, so touching
// either switches the difficulty to Custom rather than silently doing nothing.
static void setGoCustom() {
  if (g_diff == DIFF_CUSTOM) return;
  g_n = DIFF_N[g_diff];
  // Carry the preset's density over so the numbers do not jump when the row is
  // first touched.
  uint16_t cells = cubeCellCount(g_n);
  g_pct = cells ? (uint8_t)(((uint32_t)DIFF_MINES[g_diff] * 100 + cells / 2) / cells) : 17;
  if (g_pct < 5) g_pct = 5;
  if (g_pct > 40) g_pct = 40;
  g_diff = DIFF_CUSTOM;
}

