H4W9/ESP32_Mastermine/ESP32_Mastermine.ino
static void settingsFlow() {
  const int CY = CONTENTY;
  const int CH = SCRH - CONTENTY;
  const int total = SET_N * ITEMH;

  tft->fillScreen(COL_BG);
  drawHeader("Settings", true);

  TFT_eSprite spr(tft);
  spr.setColorDepth(16);
  bool haveSpr = (spr.createSprite(SCRW, CH) != nullptr);
  sprFont = nullptr;

  // The settings list is sprite-only — the rows scroll, and scrolling a
  // direct-drawn list flashes. Say so rather than leaving a blank screen.
  if (!haveSpr) {
    msgScreen("Settings", "Out of memory",
              String("Settings needs an off-screen buffer of about ")
              + (uint32_t)(SCRW * CH * 2 / 1024) +
              " KB. Check Tools -> PSRAM -> Enabled.", TFT_RED);
    return;
  }

  float scroll = 0, fling = 0;
  bool wasDown = false, moved = false;
  uint16_t pX = 0, pY = 0, lastY = 0;
  float pScroll = 0, vel = 0;
  uint32_t lastT = 0;

  auto render = [&]() {
    float maxS = total > CH ? total - CH : 0;
    if (scroll < 0) scroll = 0;
    if (scroll > maxS) scroll = maxS;
    if (haveSpr) {
      spr.fillSprite(COL_BG);
      for (int i = 0; i < SET_N; i++) {
        int y = i * ITEMH - (int)scroll;
        if (y + ITEMH < 0 || y > CH) continue;
        drawSettingRowSpr(spr, i, y);
      }
      sprScrollBar(spr, CH, total, scroll);
      spr.pushSprite(0, CY);
    }
  };
  render();

  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    uint16_t tx = touch->x(), ty = touch->y();
    uint32_t now = millis();
    bool need = false;

    if (down && !wasDown) {
      pX = tx; pY = ty; pScroll = scroll; moved = false; fling = 0; lastY = ty; lastT = now; vel = 0;
    } else if (down && wasDown) {
      int dy = (int)pY - (int)ty;
      if (abs(dy) > 6) moved = true;
      scroll = pScroll + dy;
      uint32_t dt = now - lastT;
      if (dt > 0) { vel = (float)((int)lastY - (int)ty) / (float)dt * 1000.0f; lastY = ty; lastT = now; }
      need = true;
    } else if (!down && wasDown) {
      if (!moved) {
        if (backTapped(pX, pY)) {
          if (haveSpr) spr.deleteSprite();
          ledOff();
          cfgSave();
          return;
        }
        int rowY = (int)pY - CY + (int)scroll;
        int row = rowY / ITEMH;
        if (row >= 0 && row < SET_N && rowY >= 0) {
          // Chip hit-testing works in the row's own coordinates, so feed it the
          // scroll-corrected y rather than the raw touch.
          int localY = rowY - row * ITEMH;
          int h = (row <= SET_CHIP_LAST)
                    ? chipHit(0, setChipVal(row), pX, (uint16_t)localY) : -1;
          if (row != 8) ledOff();       // LED preview only while on the LED row
          switch (row) {
            case 0: if (h >= 0) { theme.cycleTheme(h); theme.save(); applyThemeToViewManager();
                                  tft->fillScreen(COL_BG); drawHeader("Settings", true); } break;
            case 1: if (h >= 0) { theme.cycleAccent(h); theme.save(); applyThemeToViewManager(); } break;
            case 2: if (h >= 0) { theme.cycleFontCol(h); theme.save(); applyThemeToViewManager();
                                  drawHeader("Settings", true); } break;
            case 3: if (haveSpr) spr.deleteSprite();
                    skinsScreen();
                    tft->fillScreen(COL_BG); drawHeader("Settings", true);
                    if (haveSpr) { haveSpr = (spr.createSprite(SCRW, CH) != nullptr); sprFont = nullptr; }
                    break;
            case 4: if (h >= 0) { g_diff = (uint8_t)((g_diff + (h ? 1 : DIFF_COUNT - 1)) % DIFF_COUNT); } break;
            case 5: if (h >= 0) { setGoCustom();
                                  if (h == 0 && g_n > CUBE_N_MIN) g_n--;
                                  else if (h == 1 && g_n < CUBE_N_MAX) g_n++; } break;
            case 6: if (h >= 0) { setGoCustom();
                                  if (h == 0 && g_pct > 5) g_pct--;
                                  else if (h == 1 && g_pct < 40) g_pct++; } break;
            case 7: if (h == 0 && theme.bright > 0)  theme.bright--;
                    else if (h == 1 && theme.bright < 19) theme.bright++;
                    if (h >= 0) { theme.save(); applyBrightness(); } break;
            case 8: if (h == 0 && theme.led_bright > 0)  theme.led_bright--;
                    else if (h == 1 && theme.led_bright < 20) theme.led_bright++;
                    if (h >= 0) { theme.save(); ledWifi(); } break;
            case 9:  if (haveSpr) spr.deleteSprite();
                     wifiSetup();
                     tft->fillScreen(COL_BG); drawHeader("Settings", true);
                     if (haveSpr) { haveSpr = (spr.createSprite(SCRW, CH) != nullptr); sprFont = nullptr; }
                     break;
            case 10: if (haveSpr) spr.deleteSprite();
                     wifiDebug();
                     tft->fillScreen(COL_BG); drawHeader("Settings", true);
                     if (haveSpr) { haveSpr = (spr.createSprite(SCRW, CH) != nullptr); sprFont = nullptr; }
                     break;
            case 11: if (haveSpr) spr.deleteSprite();
                     aboutScreen();
                     tft->fillScreen(COL_BG); drawHeader("Settings", true);
                     if (haveSpr) { haveSpr = (spr.createSprite(SCRW, CH) != nullptr); sprFont = nullptr; }
                     break;
#ifndef HAS_CAP_TOUCH
            case 12: if (haveSpr) spr.deleteSprite();
                     touchCalRun();
                     tft->fillScreen(COL_BG); drawHeader("Settings", true);
                     if (haveSpr) { haveSpr = (spr.createSprite(SCRW, CH) != nullptr); sprFont = nullptr; }
                     break;
#endif
            default: break;
          }
        }
      } else {
        fling = vel;
      }
      need = true;
    } else if (fabs(fling) > 25) {
      scroll += fling * 0.016f;
      fling *= 0.95f;
      need = true;
    } else {
      fling = 0;
    }

    wasDown = down;
    if (need) render();
    delay(12);
  }
}

// Main menu (H4W9-style large rounded buttons)
static const char *MENU_ITEMS[] = { "New Game", "Continue", "Skins", "Settings" };
static const int    MENU_COUNT  = 4;
static const int    MENU_MARGIN = 16;
static const int    MENU_TOP    = CONTENTY + 12;
static const int    MENU_GAP    = 12;
static int menuBtnH() {
  int avail = SCRH - MENU_TOP - 12;
  return (avail - (MENU_COUNT - 1) * MENU_GAP) / MENU_COUNT;
}
static int menuBtnY(int i) { return MENU_TOP + i * (menuBtnH() + MENU_GAP); }
static int menuButtonAt(uint16_t x, uint16_t y) {
  if ((int)x < MENU_MARGIN || (int)x >= SCRW - MENU_MARGIN) return -1;
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int by = menuBtnY(i);
    if ((int)y >= by && (int)y < by + bh) return i;
  }
  return -1;
}

static void drawMenu() {
  tft->fillScreen(COL_BG);
  drawHeader(FW_NAME, false);
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int y = menuBtnY(i);
    tft->fillRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, COL_ACCENT);
    tft->drawRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, theme.neon(i * 3, COL_DIM));
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
#ifdef MARAUDER_V8
    drawStr(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 2);
#else
    drawStr(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 4);
#endif
  }
  tft->setTextDatum(TL_DATUM);
}

static void openMenuItem(int i) {
  switch (i) {
    case 0: newGameFlow(); break;
    case 1: {                                   // Continue
      if (!g_skin.loaded()) skinLoad(g_skinId);
      if (g_gameActive && g_cube.ready()) { gameScreen(); break; }
      if (g_cube.load(SAVE_DIR "/auto.sav")) {
        g_gameActive = true;
        g_banner = "";
        g_armed = -1;
        gameScreen();
      } else {
        msgScreen("Continue", "No saved game",
                  "Start a new game - it is saved automatically when you leave "
                  "the cube.", COL_DIM);
      }
      break;
    }
    case 2: skinsScreen();  break;
    case 3: settingsFlow(); break;
    default: break;
  }
  drawMenu();
}

static bool mainMenuStart(ViewManager *viewManager) {
  drawMenu();
  return true;
}

