H4W9/ESP32_Mastermine/ESP32_Mastermine.ino
static void mainMenuRun(ViewManager *viewManager) {
  static bool wasDown = false;
  TouchInput *t = viewManager->getInputManager()->getTouch();
  bool down = t->isPressed();
  if (down && !wasDown) {
    uint16_t x = t->x(), y = t->y();
    int btn = menuButtonAt(x, y);
    if (btn >= 0) openMenuItem(btn);
  }
  wasDown = down;

  // Idle refresh of ONLY the header status corner + memory readout. The menu
  // buttons depend on neither, so never repaint the whole screen here — doing
  // so made the menu flash repeatedly while a background connect cycled.
  static uint32_t lastRefresh = 0;
  static int lastStatus = -2;
  static bool lastConn = false;
  if (WiFi.status() != lastStatus || g_wifiConnecting != lastConn || millis() - lastRefresh > 4000) {
    lastRefresh = millis();
    lastStatus  = WiFi.status();
    lastConn    = g_wifiConnecting;
    drawHeaderStatus();
    drawHeaderMem();
  }
}

static const PROGMEM View mainMenuView = View("MainMenu", mainMenuRun, mainMenuStart, nullptr);

// Arduino entry points
void setup() {
  randomSeed(esp_random());
#ifndef DEVELOPER
  esp_log_level_set("*", ESP_LOG_NONE);
#endif

  Serial.begin(115200);
  uint32_t t0 = millis();
  while (!Serial && (millis() - t0) < 1500) delay(10);
  Serial.println(F("[" BOARD_NAME "] Mastermine starting..."));

  // Backlight off during init (PWM).
  pinMode(TFT_BL, OUTPUT);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(TFT_BL, 5000, 8);
  ledcWrite(TFT_BL, 0);
#else
  ledcSetup(0, 5000, 8);
  ledcAttachPin(TFT_BL, 0);
  ledcWrite(0, 0);
#endif

  // SD (shared FSPI bus on ESP32-C5) — must be up before ViewManager (Storage).
#ifdef HAS_C5_SD
  sharedSPI.begin(SD_SCK, SD_MISO, SD_MOSI);
  delay(100);
  if (!SD.begin(SD_CS, sharedSPI)) Serial.println(F("[" BOARD_NAME "] SD init failed"));
  else Serial.println(F("[" BOARD_NAME "] SD OK"));
#else
  if (!SD.begin(SD_CS)) Serial.println(F("[" BOARD_NAME "] SD init failed"));
#endif

  if (!SPIFFS.begin(true)) Serial.println(F("[" BOARD_NAME "] SPIFFS mount failed"));
  else                     Serial.println(F("[" BOARD_NAME "] SPIFFS OK"));

#ifdef HAS_PSRAM
  // The render sprite is a few hundred KB and lives in PSRAM. Without it the
  // game screen reports "Out of PSRAM" — check Tools -> PSRAM -> Enabled.
  if (!psramInit()) Serial.println(F("[" BOARD_NAME "] PSRAM unavailable"));
#endif

#ifdef HAS_CAP_TOUCH
  ft6336_init();                       // also opens the shared I2C bus
#else
  Wire.begin(I2C_SDA, I2C_SCL, 400000U);
#endif
  battInit();

  theme.load();
  cfgLoad();

  ledOff();

#ifdef MARAUDER_V8
  vm    = new ViewManager(MarauderV8Config);
#else
  vm    = new ViewManager(PancakeConfig);
#endif
  tft   = vm->getDraw()->display->getTFT();
  touch = vm->getInputManager()->getTouch();
  applyThemeToViewManager();

  applyBrightness();

#ifndef HAS_CAP_TOUCH
  if (touch) touch->attachTFT(tft);
  touchCalInit();
#endif

  // Make sure the data directories exist, so a first download has somewhere to
  // land without every caller checking.
  if (!SD.exists(MINE_DIR)) SD.mkdir(MINE_DIR);
  if (!SD.exists(SKIN_DIR)) SD.mkdir(SKIN_DIR);
  if (!SD.exists(SAVE_DIR)) SD.mkdir(SAVE_DIR);

  // Powerup tuning lives in a hand-editable XML file on the card; the first
  // run writes it out with the defaults so there is something to edit.
  g_pu.load(PU_FILE);

  WiFi.onEvent(wifiEvent);
  WiFi.mode(WIFI_STA);

  // Show the menu at once, then connect to saved WiFi in the background. The
  // skin is loaded lazily for the same reason — it is an SD read and the menu
  // should not wait on it.
  vm->add(&mainMenuView);
  vm->set("MainMenu");
  wifiBgBegin();
  drawHeaderStatus();

  Serial.println(F("[" BOARD_NAME "] Ready."));
}

void loop() {
  vm->run();
  wifiBgTick();

  // Reconnect watchdog: ONLY on the drop edge (connected -> lost), make one
  // reconnect pass. If it fails we stay disconnected rather than retrying
  // forever — the LED goes off instead of pulsing amber.
  static bool wasConnected = false;
  bool nowConnected = (WiFi.status() == WL_CONNECTED);
  if (wasConnected && !nowConnected && !g_manualDisconnect && (g_wb == WB_DONE || g_wb == WB_IDLE)) {
    wifiBgBegin();
  }
  wasConnected = nowConnected;

  static bool ledState = false;
  if (g_wifiConnecting != ledState) { ledState = g_wifiConnecting; ledSet(ledState); }

  delay(5);
}
